Lsteyn166/EPR400/STM32/RTE/Device/STM32F756VGTx/STCubeGenerated/Src/main.c
/**
  ******************************************************************************
  * File Name          : main.c
  * Description        : Main program body
  ******************************************************************************
  ** This notice applies to any and all portions of this file
  * that are not between comment pairs USER CODE BEGIN and
  * USER CODE END. Other portions of this file, whether 
  * inserted by the user or by software development tools
  * are owned by their respective copyright owners.
  *
  * COPYRIGHT(c) 2017 STMicroelectronics
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "stm32f7xx_hal.h"
#include <math.h>
#include <stdbool.h>

/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Private variables ---------------------------------------------------------*/

I2C_HandleTypeDef hi2c1;

TIM_HandleTypeDef htim6;
TIM_HandleTypeDef htim7;

UART_HandleTypeDef huart1;
UART_HandleTypeDef huart3;

/* USER CODE BEGIN PV */
/* Private variables ---------------------------------------------------------*/
unsigned char RXData[15];																//Array for Bluetooth reception
unsigned char X_Char;																		//Stores received X as Char
unsigned char Y_Char;																		//Stores received Y as Char
unsigned char R_Char;																		//Stores received R as Char
int X_Vect =0;																					//Stores received X as Int
int Y_Vect =0;																					//Stores received Y as Int
int R_Vect =0;																					//Stores received R as Int
int legAngles[15];																			//Stores the desired angle for each limb
int legAngles_id[] = {1, 2, 3, 4, 5,										//Stores the ID of each limb for sorting
											6, 7, 8, 9, 10,
											11, 12, 13, 14, 15};
int servoOffset[] = {300,305,300,305,285,								//Array for storing the offset of each servo
											430,460,450,440,442,
											-110,-112,-105,-78,-98};		
int servoMultiplier[] = {	-360,-360,-363,-365,-360,			//Array for storing the multiplier of each servo
													-400,-400,-400,-400,-400,
													480,545,490,460,500};		
int servoCount = 0;																			//Counter used for keeping track of servo interrupts
char servoCountChar[2];
int BTCount = 0;																				//Counter for BlueTooth LED
int newPeriod = 0;

static TIM_HandleTypeDef ServoTimer;
static TIM_HandleTypeDef ServoTimer2;

unsigned char BTRewrite[] = {'X','Y','R','\r'};					//String used for debugging

struct servos {
	int theta;
	int phi;
	int alpha;
};

struct coordinates{
	double x;
	double y;
	double z;
};

double rad2deg = 57.29577951308232;
double A_length = 50;
double B_length = 106;
double C_length = 130;
double z_body = 30;
double robotRadius = 90;

bool resetStatus[5];																		//Array used to store reset status of each leg

double X_Vector = 0;																		//Global movement vectors
double Y_Vector = 0;
double R_Vector = 0;	

double destination[2][5];																//2D array that stores X([0]) and Y([1]) values 
																												//for the destination of each foot
double currentPosition[2][5];														//2D array that stores X and Y values for the 
																												//current position of each foot
double translateLeg[2][5];															//Stores coordinates of joint 1 for each leg.
																												//Replaces TranslateLeg()
//Peripheral pin & port difinitions
#define BTPort 					GPIOE
#define BTLEDPin 				GPIO_PIN_0
#define redLEDPort 			GPIOB
#define redLEDPin 			GPIO_PIN_9
#define greenLEDPort 		GPIOB
#define greenLEDPin 		GPIO_PIN_8
#define servoPowerPort	GPIOC
#define servoPowerPin		GPIO_PIN_9

//Servo pin & port definitions
#define servo1Pin 		GPIO_PIN_12
#define servo1Port 		GPIOB
#define servo2Pin 		GPIO_PIN_13
#define servo2Port 		GPIOB
#define servo3Pin 		GPIO_PIN_14
#define servo3Port 		GPIOB
#define servo4Pin 		GPIO_PIN_15
#define servo4Port 		GPIOB
#define servo5Pin 		GPIO_PIN_8
#define servo5Port 		GPIOD
#define servo6Pin 		GPIO_PIN_9
#define servo6Port 		GPIOD
#define servo7Pin 		GPIO_PIN_10
#define servo7Port 		GPIOD
#define servo8Pin 		GPIO_PIN_11
#define servo8Port 		GPIOD
#define servo9Pin 		GPIO_PIN_12
#define servo9Port 		GPIOD
#define servo10Pin 		GPIO_PIN_13
#define servo10Port 	GPIOD
#define servo11Pin 		GPIO_PIN_14
#define servo11Port 	GPIOD
#define servo12Pin 		GPIO_PIN_15
#define servo12Port 	GPIOD
#define servo13Pin 		GPIO_PIN_6
#define servo13Port 	GPIOC
#define servo14Pin 		GPIO_PIN_7
#define servo14Port 	GPIOC
#define servo15Pin 		GPIO_PIN_8
#define servo15Port 	GPIOC

uint16_t servoPinArray[] ={	servo1Pin, servo2Pin, servo3Pin,
														servo4Pin, servo5Pin, servo6Pin,
														servo7Pin, servo8Pin, servo9Pin,
														servo10Pin, servo11Pin, servo12Pin,
														servo13Pin, servo14Pin, servo15Pin};

GPIO_TypeDef * servoPortArray[] = {	servo1Port, servo2Port, servo3Port,
																		servo4Port, servo5Port, servo6Port,
																		servo7Port, servo8Port, servo9Port,
																		servo10Port, servo11Port, servo12Port,
																		servo13Port, servo14Port, servo15Port};
/* USER CODE END PV */

